{"content": "# Andy Barrows\n\nOlathe, KS 66062 | 913 548 6290 | [me@andybarrows.com](mailto:me@andybarrows.com) | [linkedin.com/in/andybarrows](https://www.linkedin.com/in/andybarrows) | [AndyBarrows.com](https://andybarrows.com)\n\n## Software Engineering Manager\n\nAccomplished Software Engineering Manager renowned for growing award-winning teams. 17 years of full-stack expertise with over 26,000 contributions while transforming the world's largest syndicate. A servant leader with a proven track record guiding teams to excellence, winning a Webby Award for TheFarside.com within 3 years of leadership. Championed efforts that elevated ad revenue growth by 35% while bringing delight to 8.6 million users across 40 digital products. Offers a unique approach to \"Product-First\" culture, acclaimed for its shared efficiencies and record-setting team performance that force-multiplies company success.\n\n## Skills\n\n**Languages & Core Proficiencies:** ActionScript, AJAX, ASP.NET, Back-end Engineering, Back-End Web Development, Cascading Style Sheets (CSS), CSS, CSS Grid Layout, Flash, Front-End Development, Front-end Engineering, Full-Stack Development, Git, GO, HAML, HTML5, Java, JavaScript, JSON, Node.js, Onpage SEO, PERL, PHP, Prompt Engineering, Python, Responsive Web Design, RESTful WebServices, Ruby on Rails, SASS, SCSS, TypeScript, XHTML, XML, YML\n\n**Frameworks & Platforms:** A/B Testing, AWS, Bootstrap (Framework), CCPA, Cypress, Drupal, GCP, GDPR, Google Analytics, GTM, Jest, Joomla, Material UI, Microsoft Azure, Next.js, OpenAPI Specification (OAS), Playwright, React.js, Single Page Applications, Stripe, Structured Data (JSON-LD), Tailwind CSS, Wordpress (WP)\n\n**Tools:** ChatGPT, Claude, Figma, Google Gemini, Illustrator, Microsoft & Github CoPilot, Photoshop, Sketch, VS Code, Warp\n\n**Specialized Skills:** Agile Methodologies, Artificial Intelligence (AI), Automated Software Testing, Azure DevOps Services, Content Management Systems (CMS), Continuous Integration and Continuous Delivery (CI/CD), CyberSecurity, Data Analytics, Data Science, Developer Experience, DevOps, Digital Marketing, Ecommerce Systems, Email Marketing, Engineering Management, Enterprise Architecture, GitOps, High Performance Web Sites, Information Architecture, Leading Development Teams, Microservices, Online Advertising, Programmatic Advertising, Project Management, QA Automation, Release Management, Search Engine Optimization (SEO), Servant Leadership, Software Architecture, Software Development, Technical Architecture, User Behavior, User Experience, User Experience Design (UX/UXD), User Experience (UX), User Interface Design, User Privacy Compliance, Web Accessibility, Web Application Security, Web Design, Web Development, Web Performance\n\n## Work Experience\n\n### Andrews McMeel Universal | Kansas City, MO | 03/2010 - 04/2024\n\n#### Software Engineering Manager | 08/2019 - 04/2024\n\n- **Led application architecture and development across 40 high-performing websites, increasing total users to 8.6 million monthly users**; built with React, Next.js on Docker/Kubernetes in Azure.\n- **Increased monthly user impressions to 4.5 million through delivery architecture innovation**, quickly attracting contracts from 150+ sites, including US top 40 ranked sites like Yahoo & NY Times.\n- **Championed integration of AI across the AMU Enterprise**, institutionalizing an AI committee and usage guidelines by showcasing enterprise models such as CoPilot, Gemini Pro, and ChatGPT; helped leadership understand the potential risks and capabilities on business objectives and creators.\n- **Pioneered a widely acclaimed front-end developer experience that reduced non-coding activities from 65 minutes to less than 5 minutes per ticket without engineers having to leave their development environment**; built with AI, Github Actions, Docker, and continuous feedback from the team.\n- **Served as a vanguard for fast-paced professional growth among engineers**; achieving 6 job promotions in 5 years as manager, 50% more than all other engineering teams combined.\n- **Evangelized growth-minded, skills-based culture for engineering teams and across company within 2 years**; by establishing a \"progression bands\" system that streamlined career growth and advanced skills for technical roles.\n- **Increased speed to market by 66% within 6 months by innovating a blueprint codebase system** that stored all team-approved principle React components, Next.js tooling, and API patterns while automatically syncing emerging team changes with projects connected to the blueprint.\n- **Achieved higher throughput and reduced visual regression by adopting design system packages in Figma** and strengthening partnerships between Software Engineering and User Experience Design (UXD) teams while scaling out enterprise design themes for flagship products.\n- **Streamlined software engineers onboarding by 77% through reducing the onboarding procedure from 60 days to 14 days** and institutionalized throughout technical teams.\n- **Accelerated hiring process by 44% by implementing a Hiring Matrix system**, resulting in a more efficient and inclusive hiring practice which improved from recruiter and new engineers' feedback.\n- **Managed a collaborative response to a state-sponsored ransomware attack, achieving 100% data recovery in four days without paying a ransom**. This ensured service continuity, met all SLA commitments, and involved coordination with senior leadership, cyber insurance, and FBI.\n- **Streamlined support ticket resolution by reducing average resolution time by 38%** through a 3-month migration to Zendesk Enterprise, which integrated with Jira for seamless engineering staff. Directed technical architecture and worked closely with customer support and directors.\n- **Streamlined AA compliance for 40 enterprise web applications, preventing legal risks**. Created WCAG training and roadmap while coaching a junior engineer to guide 8 engineers to advanced proficiencies in web accessibility while integrating Accessible-First standards into the department.\n- **Institutionalized company-wide hybrid work schedule in 3 years following department adoption**.\n\n#### Lead Front-End Engineer | 01/2017 - 07/2019\n\n- **Achieved AA compliance for several flagship products at scale, preventing legal risks**. Orchestrated WCAG training while empowering junior engineer specializing in accessibility to lead front-end engineers during coursework. Resulted in 100% course completion and accessibility streamlined into workflow process within 4 months.\n- **Led our front-end engineering team through development on thefarside.com which won a Webby Award in 2020**; built in Ruby on Rails, Redux, Webpack with microservices and PostgreSQL.\n- **In 5 months, increased deployment speeds by 22% and vastly improved code quality in flagship products** by orchestrating a 12-point checklist on CI/CD pipeline while coaching DevOps team.\n- **Reduced enterprise hosting cost by 60% during a 5-year cloud migration plan to Azure**. Transitioned 40 digital products and 80 services from Ruby on Rails, Python, GO to a modern architecture by migrating UIs to React.js, Next.js and RESTful APIs while supporting DevOps team.\n- **In 3 months, reduced infrastructure attack surface to a minimal rating during an independent cybersecurity audit by a leading consulting firm**. Fostered transparency and delegated security tasks while serving as key liaison.\n- **Led a User Privacy Compliance campaign across 16 product roadmaps resulting in 100% CCPA, GDPR, and COPA regulations within 9 months** while training engineers \"Privacy First\" best practices and ongoing procedures.\n- **Increased security, efficiency, and broadened capabilities within 2 months by automating the migration of the organization's 400 repositories from Bitbucket to GitHub** while prototyping a Node.js utility with lead engineers.\n- **Spearheaded enterprise adoption of the Atlassian suite within 8 months**, resulting in streamlined task management by configuring highly customized workflows while continuing to improve based on business needs.\n- **Spearheaded reduction in annual budget by nearly 50%**. Adopted zero-based strategy to eliminate unnecessary expenses and strategically shifted to more cost-effective platforms like Atlassian, Github, and Browserstack while negotiating with partners.\n- **Reduced maintenance effort by 70% across consumer brand products within 12 months by implementing refactor strategies and AI tools capable of automating maintenance upgrades** while encouraging peer technical leads to research similar approaches for flagship products.\n- **In 18 months, boosted ad-bearing sites revenue by 34% and peaking to 7 million**. By engineering prebid capabilities using JavaScript, prebid, GTM, and AWS ad servers while working with AdOps and over 20 ad partners.\n- **Institutionalized \"Security-First\" best practices and significantly reduced attack surface for 45 employees** by onboarding 1Password Enterprise in 9 months.\n\n#### Web Developer | 03/2011 - 12/2017\n\n- **Increased monthly user impressions to 4.5 million through delivery architecture innovation still in operation**. The service quickly attracted contracts from 150+ sites, including US top 40 ranked sites like Yahoo & NY Times.\n- **Increased paid user subscriptions by 19,000, over triple the projected goal**. Researched, designed UX, and delivered in 5 months the most successful digital retention campaign in AMU’s history.\n- **Increased organic growth on GoComics.com by 456%, ranking on US' Top 500 websites within 10 years by executing a long-term strategic roadmap improving site capabilities and user experience**.\n- **Led and facilitated over 6k successful production releases while personally totaling 26,000 contributions** supporting our enterprise of products and services.\n- Served a crucial role in the education and facilitating the adoption of advanced front-end strategies, thereby enhancing our digital market success. This included implementing responsive design, A/B testing, SEO, style guides, web-accessibility, deployment checklists, web performance audits among other leading industry standards in our development process.\n- **Evangelized a data-driven culture by implementing Google Analytics across 70 digital applications while standardizing information architecture**. Trained Finance, Digital Products, and Marketing departments, leading to the formation of a formal Data Analytics Team within 2 years.\n\n#### Game Developer | 03/2010 - 03/2011\n\n- **Proactively campaigned transitioning from Flash to HTML5 years ahead of browsers dropping support**. After researching market data, proposed a strategy and guidelines for external game developers to rewrite core game titles like USA Today Crossword, Daily Sudoku, and AARP Crossword.\n- **Reduced maintenance by 90% by converting 80 games into scalable engines with client versions**.\n\n### Affiliate Strategies Inc. | Overland Park, KS | 07/2008 - 03/2010\n\n#### Full Stack Developer | 07/2008 - 03/2010\n\n- **Led backend and digital strategy development for 11 subsidiary companies**, enhancing online presence and user experience across web and marketing platforms.\n- **Engineered front-end and infrastructure solutions** with ASP.NET and DevOps teams, focusing on domain, DNS, and Microsoft Exchange optimizations.\n- **Fostered key local partnerships and managed lead generation and marketing for major business conferences**, driving growth and engagement.\n\n### Binary Catalyst | Kansas City, MO 11/2006 - 03/2010\n\n#### Founder 11/2006 - 03/2010\n\n- **Designed, developed, and delivered technical solutions** to meet business needs while consulting for a wide range of clients.\n- Refined efficient process for managing contracts including SLA's, legal documentation, and standard procedures through continuous iteration while delivering to a growing client-base.\n- **Scaled business within the first three years** by subcontracting two front-end developers, a software engineer, and a photographer while meeting client needs.\n\n### Adamson USA | Lee Summit, MO | 02/2009 - 02/2010\n\n#### Web Integrator | 02/2009 - 02/2010\n\n- Secured and retained major clients commitments by delivering digital marketing products to **iconic brands like Kawasaki, ExxonMobil, Earth's Best, some boasting six-figure budgets.**\n\n- Extending company and client digital capabilities by completing several high-value CMS driven site rebuilds including the company's corporate website while serving our team as the primary web developer.\n\n### Muller Bressler Brown | Kansas City, MO | 03/2008 - 08/2008\n\n#### PHP Developer | 03/2008 - 08/2008\n\n- Fulfilled advertising contracts for notable clients like the Kansas City Chiefs. Maintained and integrated AWS web services to populate data to a Drupal backend.\n- Increased client engagement by implementing email marketing campaigns and PHP management system for notable initiatives like the Special Olympics.\n- Delivered innovation to clients by developing a custom RSVP invite system and deployed an email blaster compatible across major browsers, significantly improving event management and marketing effectiveness.\n\n### Handmark Digital Agency | Kansas City, MO | 12/2007 - 05/2008\n\n#### Front-End Web Developer | 12/2007 - 05/2008\n\n- Maintained a cohesive brand experience by converting web and mobile corporate site designs into standards-compliant code while assisting the Creative Director.\n- Enhanced user engagement across key web pages by employing adaptive mobile webpage development techniques and rigorous cross-browser/platform testing while being mentored by lead front-end developer.\n- Improved both application security and user experience by developing SMS/authentication capabilities to download custom delivered games while collaborating with back-end teams.\n- Assisted in our 75% reduction in downtime during deployments by orchestrating deployment checklist tasks across multiple mobile networks while remotely.\n\n## Volunteering & Leadership\n\n### United States Military | Fort Bragg, NC 03/2003 - 03/2009\n\n#### Army Reserves - 37F Psychological Operations\n\n- Expert in Behavioral Analysis and Target Audience Segmentation by utilized advanced psychological principles and data analytics to develop targeted campaigns, significantly increasing the effectiveness of operations and supporting coalition efforts.\n- Completed rigorous advanced training in Psychological warfare tactics.\n  - Acquired proficiency in the tools and technologies essential for modern psy-ops, including digital media manipulation and propaganda dissemination.\n  - Achieved mission success by leading small teams to rapidly adapt tactical strategies while serving as team leader.\n  - Attained expert marksmanship and demonstrated proficiencies across a diverse range of weapons systems.\n\n## Volunteering & Leadership\n\n### United States Military | 2003 - 2009\n\nArmy Reserves - 37F Psychological Operations | Fort Bragg, NC\n\n- Expert in Behavioral Analysis and target audience segmentation through rigorous special operations training in psychological campaigns and influence operations force-multiplying success for coalition.\n  - Acquired proficiency in the tools and technologies essential for modern psy-ops, including digital media manipulation and propaganda dissemination.\n  - Achieved mission success by leading small teams to rapidly adapt tactical strategies while serving as team leader.\n  - Attained expert marksmanship and demonstrated proficiencies across a diverse range of weapons systems.\n\n## Certifications\n\n- A+, Certified Internet Web Developer (CIWD) | Centriq Foss 12/2007\n\n## Awards & Scholarships\n\n- Webby Award for <Https://www.thefarside.com> | 01/2020\n\n## Education\n\n### Centriq Foss IT Institution\n\n- Placed in a role within 60 days of completing vocational school.\n- Completed the Certified Internet Web Developer track, reached working proficiencies in web layout patterns, web design/UX design, programming, web services, version control and release management while attending an intense 40 hours a week vocational training schedule.\n- Received advanced training in computer hardware, operating systems, repair, and modification skills, resulting in successfully passing the A+ certification exam.\n\n#### A+ In IC3 Certifications, Certified Internet Web Developer\n\n### Johnson County Community College\n\n- With one semester left, required to withdraw due to joining the military and beginning US Army basic training.\n\n#### Associates | JCCC | 01/2002 - 12/2003\n"}